{
  "backend/main.mo": "Motoko canister defining products, user profiles, locations, and admin/user‑authorized CRUD operations with access control.",
  "feature_evidence.json": "Feature evidence report listing branding and logo update requirements with affected frontend files and metadata.",
  "frontend-file-summaries.txt": "Text file containing short summaries of numerous frontend components, pages, and hooks.",
  "frontend/index.css": "Tailwind CSS setup defining global CSS variables, light/dark themes, and base styling.",
  "frontend/index.html": "HTML entry point setting page title to QUICK-D and mounting the React app.",
  "frontend/src/App.tsx": "Main React router configuration with public, protected, and admin routes and layout/guard components.",
  "frontend/src/components/qd/AddressBook.tsx": "Local address book component allowing users to add and select delivery addresses via a dialog form.",
  "frontend/src/components/qd/AddToCartButton.tsx": "UI button component that adds a product to the cart with toast feedback and temporary added state.",
  "frontend/src/components/qd/AdminRouteGuard.tsx": "Guards admin-only routes by checking actor admin status and shows loading or access denied states.",
  "frontend/src/components/qd/BannerCarousel.tsx": "Displays an auto-advancing carousel of promotional banners with gradient backgrounds and images.",
  "frontend/src/components/qd/CartItem.tsx": "Renders a cart item with image, price, quantity controls, and remove functionality.",
  "frontend/src/components/qd/CouponInput.tsx": "Handles coupon entry, validation, application, and removal with toast feedback.",
  "frontend/src/components/qd/EmptyState.tsx": "Shows an empty-state view with optional icon/image, description, and action button.",
  "frontend/src/components/qd/ErrorState.tsx": "Displays an error alert with title, message, and optional retry button.",
  "frontend/src/components/qd/GradientShell.tsx": "Wraps children in a full-screen gradient background container.",
  "frontend/src/components/qd/LocationPicker.tsx": "Allows users to detect, enter, and save latitude/longitude coordinates with geolocation support.",
  "frontend/src/components/qd/NotificationsBell.tsx": "Shows a notifications bell button with an unread badge and navigates to notifications.",
  "frontend/src/components/qd/OrderCard.tsx": "Displays order summary info with status badge and a button to open order tracking.",
  "frontend/src/components/qd/OrderTimeline.tsx": "Visual timeline showing order progress with icons, completed states, and current status.",
  "frontend/src/components/qd/PaymentMethodPicker.tsx": "Lets users select a payment method from preset options with visual selection state.",
  "frontend/src/components/qd/PricingSummary.tsx": "Calculates and displays subtotal, discount, delivery charge, tax, and final total.",
  "frontend/src/components/qd/ProductCard.tsx": "Displays a product card with image, pricing, discount, stock status, and add‑to‑cart button, navigating to the product page on click.",
  "frontend/src/components/qd/ProfileSetupModal.tsx": "Shows a modal prompting new authenticated users to enter their name and saves the profile via mutation.",
  "frontend/src/components/qd/SearchBarWithSuggestions.tsx": "Implements a search bar with debounced product suggestions and navigation to product or catalog pages.",
  "frontend/src/components/qd/Skeletons.tsx": "Provides skeleton placeholder components for product and order cards during loading states.",
  "frontend/src/hooks/qd/admin/useAdminProducts.ts": "Contains mutations to add, update, and delete products through the actor API and invalidates product queries.",
  "frontend/src/hooks/qd/admin/useSeedData.ts": "Defines sample product seed data and a mutation hook for seeding product data into the backend.",
  "frontend/src/hooks/qd/useLocation.ts": "Fetches and mutates caller location data using actor methods and invalidates related queries.",
  "frontend/src/hooks/qd/useNotifications.ts": "Returns a periodically‑polled mock notifications list using react‑query.",
  "frontend/src/hooks/qd/usePolling.ts": "Custom hook for running a callback repeatedly on a set interval when enabled.",
  "frontend/src/hooks/qd/useProducts.ts": "Provides queries for fetching all products, a product by ID, or products by category via the actor API.",
  "frontend/src/hooks/qd/useServiceAvailability.ts": "Checks service availability based on the user's saved location using actor.isServiceAvailable.",
  "frontend/src/hooks/qd/useUserProfile.ts": "Fetches and saves the caller's user profile, updating related queries on mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on authentication, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication, wrapping AuthClient setup, login handling, and identity state management.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables, gradients, animations, and utility classes for the app's UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/admin/AdminAccessDenied.tsx": "Displays an access denied message for unauthorized admin users with a button to return home.",
  "frontend/src/pages/admin/AdminCategories.tsx": "Placeholder page showing that category management is pending backend support.",
  "frontend/src/pages/admin/AdminCoupons.tsx": "Loads and displays seeded coupon codes with badges and descriptions.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Static admin dashboard showing placeholder metrics for users, orders, and revenue.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Admin panel layout with sidebar navigation and routed main content area.",
  "frontend/src/pages/admin/AdminOrders.tsx": "Placeholder page indicating order management will be implemented later.",
  "frontend/src/pages/admin/AdminProducts.tsx": "Admin interface for listing, adding, editing, and deleting products with form dialogs.",
  "frontend/src/pages/admin/AdminSeed.tsx": "Triggers seeding of sample data and displays status after initialization.",
  "frontend/src/pages/admin/AdminServiceConfig.tsx": "Static display of current store location and delivery radius with note to modify backend for changes.",
  "frontend/src/pages/admin/AdminUsers.tsx": "Placeholder page for future user management features.",
  "frontend/src/pages/Auth.tsx": "Provides a login screen using Internet Identity, redirecting authenticated users and showing feature highlights and login status.",
  "frontend/src/pages/Cart.tsx": "Displays the shopping cart with item list, coupon input, pricing summary, and an empty state; allows navigation to checkout or catalog.",
  "frontend/src/pages/Catalog.tsx": "Shows products filtered by category or search query, using product hooks and rendering cards or skeletons based on loading state.",
  "frontend/src/pages/Checkout.tsx": "Handles address selection, payment method choice, order validation, and simulated order placement with navigation and toast feedback.",
  "frontend/src/pages/Docs.tsx": "Displays documentation sections for development, configuration, and deployment using cards with code snippets.",
  "frontend/src/pages/Home.tsx": "Homepage showing search, banners, categories, and product lists with navigation and cart integration.",
  "frontend/src/pages/Notifications.tsx": "Notifications page showing an empty state when no alerts are available.",
  "frontend/src/pages/Orders.tsx": "Lists past orders or shows an empty state when none exist.",
  "frontend/src/pages/OrderSuccess.tsx": "Order confirmation page displaying success details and navigation to tracking or home.",
  "frontend/src/pages/OrderTracking.tsx": "Shows tracking details for an order, including status timeline and estimated delivery.",
  "frontend/src/pages/OutOfRadius.tsx": "Informs users they are outside the delivery area and provides options to update location or return home.",
  "frontend/src/pages/ProductDetail.tsx": "Displays detailed product info with pricing, stock, images, discount badges, and add-to-cart options.",
  "frontend/src/pages/Profile.tsx": "Profile page showing user info, location settings, links to orders/docs, and logout functionality.",
  "frontend/src/pages/Splash.tsx": "Splash screen that waits for identity initialization, then navigates to home or auth after a delay.",
  "frontend/src/state/cart.ts": "Zustand store managing cart items, updates, removal, persistence, and total calculation.",
  "frontend/src/state/coupons.ts": "Zustand store for coupon seeding, application, removal, and discount calculation.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read URL params (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Tailwind setup extending colors, radii, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing QUICK-D’s architecture, features, branding updates, and development requirements."
}